from langchain_core.prompts import PromptTemplate

ayah_prompt_allam = PromptTemplate(template="""
<s>
[INST]
أجب على السؤال المعطى لك من خلال فهم النص المعطى لك.
ملحوطات تساعدك فى الإجابة:
- "ayah" تعنى نص آية القرآن الكريم
- "I3rab" تعنى إعراب آية القرآن الكريم
- "Tafseer_Saadi" تعنى تفسير آية القرآن الكريم
- "telawa" تعنى رابط لمقطع صوتى لشيخ يقرأ آية القرآن قراءة صحيحة

                                   
صيغة الإخراج المطلوبة إذا كان فهم النص المعطى يعطى الإجابة:
```json
{{
"answer": "[إجابة السؤال]"
}}```
,
صيغة الإخراج المطلوبة إذا لم توجد الإجابة فى النص المعطى:
```json
{{
"answer": "none"
}}```

ملحوظة مهمة:
إذا كان معنى الكلمة به `'` أو  `"` استبدلهما ب `❝`
                        
قم بدورك الآن. هذا هو السؤال المعطى لك:
{query}

وهذا هو النص المعطى لك:
{context}     
[/INST]
""")

ayah_prompt_gemini = PromptTemplate(template="""
                                    
أجب على السؤال المعطى لك من خلال فهم النص المعطى لك.

ملحوطات تساعدك فى الإجابة:
- "ayah" تعنى نص آية القرآن الكريم
- "I3rab" تعنى إعراب آية القرآن الكريم
- "Tafseer_Saadi" تعنى تفسير آية القرآن الكريم
- "telawa" تعنى رابط لمقطع صوتى لشيخ يقرأ آية القرآن قراءة صحيحة

صيغة الإخراج المطلوبة إذا كان فهم النص المعطى يعطى الإجابة:
```json
{{
"answer": "[إجابة السؤال]"
}}```
,
صيغة الإخراج المطلوبة إذا لم توجد الإجابة فى النص المعطى:
```json
{{
"answer": "none"
}}```

ملحوظة مهمة:
إذا كان معنى الكلمة به `'` أو  `"` استبدلهما ب `❝`
                        
قم بدورك الآن. هذا هو السؤال المعطى لك:
{query}

وهذا هو النص المعطى لك:
{context}     

""")
