# Import prompt template
from langchain_core.prompts import PromptTemplate


small_irab_prompt = PromptTemplate(
    template="""<s> [INST] أنت خبير في قواعد اللغة العربية وإعرابها. مهمتك هي تقديم الإعراب النحوي الكامل للجملة المراد إعرابها بشكل طبيعي وسلس.

الجملة الأصلية هي:
{original_sentence}

الجملة المراد إعرابها هي:
{sentence}

قم بتقديم الإعراب في صيغة واضحة دون الدخول في تفاصيل تحليل كل كلمة على حدة. قدم الإعراب ككل.
[/INST]""",
    input_variables=["sentence", "original_sentence"],
)

# Build custom prompt
irab_prompt = PromptTemplate(
    template="""<s> [INST] أنت خبير في قواعد اللغة العربية وإعرابها. مهمتك هي تقديم تحليل نحوي مفصّل للجملة المقدمة. اتبع الخطوات التالية:

1. قم بتحديد نوع الجملة (اسمية أو فعلية).

2. حلل كل كلمة في الجملة بالترتيب، مع توضيح ما يلي لكل كلمة:

أ. الوظيفة النحوية (فاعل، مفعول به، مبتدأ، خبر، إلخ)
ب. الإعراب الكامل (مرفوع، منصوب، مجرور، مجزوم) مع ذكر علامة الإعراب
ج. أي معلومات صرفية إضافية (مثل الجذر، الوزن، التصريف)


3. إذا احتوت الجملة على **تعابير اصطلاحية** أو **تراكيب معقدة**، قم بما يلي:
- وضّح كيف يؤثر ذلك على التحليل النحوي التقليدي.
- حدد ما إذا كانت الكلمة أو العبارة تخرج عن القاعدة أو تخضع لتراكيب خاصة.
- إذا كان هناك **إضمار** أو **مجاز**، وضّح كيفية الإعراب المناسب.
- إذا كانت الجملة تحتوي على **ضمائر**، تأكد من تحديد الضمير وإعرابه بشكل صحيح.
- إذا كانت الجملة تحتوي على **أسماء الإشارة**، تأكد من تحديد الاسم وإعرابه بشكل صحيح.
- إذا كان هناك شبه جملة جار ومجرور تأكد من تحديد الجار والمجرور وإعرابهما بشكل صحيح. مثل "بوضوح" أو "بإمعان".


مثال 1: 
 1. نوع الجملة: فعلية

2. تحليل الكلمات:

- شرحَ:
أ. الوظيفة النحوية: فعل ماضٍ مبني على الفتح.
ب. الإعراب الكامل: فعل ماضٍ مرفوع وعلامة رفعه الضمة الظاهرة.

- المعلمُ:
أ. الوظيفة النحوية: فاعل مرفوع.
ب. الإعراب الكامل: فاعل مرفوع وعلامة رفعه الضمة الظاهرة.

- الدرسَ:
أ. الوظيفة النحوية: مفعول به منصوب.
ب. الإعراب الكامل: مفعول به منصوب وعلامة نصبه الفتحة الظاهرة.

- بوضوحٍ:
أ. الوظيفة النحوية: شبه جملة جار ومجرور.
ب. الإعراب الكامل: الباء حرف جر، ووضوح اسم مجرور وعلامة جره الكسرة الظاهرة

3. شبه الجملة "بوضوحٍ":
- تعتبر شبه جملة جار ومجرور. فى محال نصب حال
الإعراب: وشبه الجملة في محل نصب حال.


مثال 2:

الجملة: "الطالبُ لم يسعَ إلى النجاحِ بنفسه سريعًا."

1. نوع الجملة: اسمية.

2. تحليل الكلمات:


- الطالبُ:
أ. الوظيفة النحوية: مبتدأ.
ب. الإعراب الكامل: مبتدأ مرفوع وعلامة رفعه الضمة الظاهرة.

- لم:
أ. الوظيفة النحوية: حرف نفي وجزم.

- يسعَ:
أ. الوظيفة النحوية: فعل مضارع.
ب. الإعراب الكامل: فعل مضارع مجزوم بحذف حرف العلة.

- إلى:
أ. الوظيفة النحوية: حرف جر.

- النجاحِ:
أ. الوظيفة النحوية: اسم مجرور متعلق بالفعل "يسعَ".
ب. الإعراب الكامل: اسم مجرور وعلامة جره الكسرة الظاهرة.

- بنفسه:
أ. الوظيفة النحوية: جار ومجرور متعلق بالفعل "يسعَ".
ب. الإعراب الكامل: الباء حرف جر ونفس اسم مجرور وعلامة جره الكسرة الظاهرة. والهاء ضمير مبني فى محل جر مضاف إليه

- سريعًا:
أ. الوظيفة النحوية: حال يوضح كيفية السعي.
ب. الإعراب الكامل: حال منصوب، وعلامة نصبه الفتحة الظاهرة.


3. الجملة الفعلية "لم يسعَ إلى النجاح بنفسه سريعًا": 
- "يسع" فعل مضارع مجزوم بحذف حرف العلة.
- الجملة الفعلية في محل رفع خبر للمبتدأ "الطالب".




الجملة الكاملة: {original_sentence}

الجملة المراد إعرابها هي:
{sentence}

قم بتقديم إجابتك بتنسيق منظم وواضح، مع استخدام النقاط والأرقام لتسهيل القراءة.
[/INST]""",
    input_variables=["sentence", "original_sentence"],
)


split_prompt = PromptTemplate(
    template="""<s>  [INST] You are an expert in Arabic syntax. Your task is to break down a long Arabic paragraph into  sentences :

paragraph: {sentence}

Split the paragraph into individual sentences **only if** it can be more than a sentence.
If the paragraph is already a single sentence, you can leave it as is.
examples: 

Provide your output in a clear list format, with each sentence on a new line.
Using this structure:
paragraph: "The Original paragraph here"

Stick to **output format** below:
`
Output:
- "The first split sentence here"
- "The second split sentence here" (optional) as the original paragraph might not require splitting.
- "The third split sentence here" (optional) and so on.
`
[/INST]""",
    input_variables=["sentence"],
)


critic_prompt = PromptTemplate(
    template="""
    <s> [INST] أنت ناقد خبير في قواعد النحو العربي. مهمتك هي مراجعة نتائج الإعراب المقدمة للجملة والتأكد من دقتها بناءً على القواعد النحوية المعروفة. قم بما يلي:

    1. تحقق مما إذا تم تحديد نوع الجملة بشكل صحيح (اسمية أو فعلية).
    2. تأكد من أن كل كلمة تم تحليلها بشكل صحيح وفقًا لوظيفتها النحوية (مثل فاعل، مفعول به، مبتدأ، خبر).
    3. تأكد من أن الإعراب الكامل لكل كلمة (مثل مرفوع، منصوب، مجرور) تم تحديده بشكل صحيح مع ذكر العلامات المناسبة.
    4. راجع أي تعابير اصطلاحية أو تراكيب معقدة للتأكد من أنها تم التعامل معها بشكل صحيح.
    5. قدم تعليقًا نقديًا على الأخطاء أو التحسينات المطلوبة، وإذا كانت الإجابة كاملة وصحيحة فقم بتأكيد صحتها.
    6. إذا كان هناك شبه جملة جار ومجرور تأكد من تحديد الجار والمجرور وإعرابهما بشكل صحيح. مثل "بوضوح" أو "بإمعان".
    7. لاحظ الضمائر مثل هم أو هن أو أولئك أو غيرها.
    مثال 1:

    الجملة: "الطالبُ لم يسعَ إلى النجاحِ بنفسه سريعًا."
    
    الإعراب المقدم: 
    - الطالبُ: مبتدأ مرفوع وعلامة رفعه الضمة الظاهرة.
    - لم: حرف نفي وجزم.
    - يسعَ: فعل مضارع مجزوم بحذف حرف العلة.
    - إلى: حرف جر.
    - النجاحِ: اسم مجرور وعلامة جره الكسرة.
    - بنفسه: الباء حرف جر ونفس اسم مجرور وعلامة جره الكسرة الظاهرة. والهاء ضمير مبني فى محل جر مضاف إليه.
    - سريعًا: حال منصوب وعلامة نصبه الفتحة الظاهرة.
    
    النقد:
    - الإعراب المقدم صحيح، ولا توجد أخطاء في التحليل.
    - التحليل النحوي سليم ويطابق القواعد النحوية.

    مثال 2:
    الجملة : "أجاب الطالب على السؤال بوضوح"

  الإعراب المقدم:
  - أجاب: فعل ماضي مبني على الفتح.
  - الطالب: فاعل مرفوع بالضمة الظاهرة.
  - على: حرف جر.
  - السؤال: اسم مجرور بالكسرة الظاهرة.
  - بوضوح: حال منصوب بالفتحة الظاهرة.
  
النقد:
- الإعراب المقدم يحتوي على خطأ، حيث إن "بوضوح" ليست حالًا، بل تُعرب كشبه جملة.
- التحليل النحوي يحتاج إلى تعديل ليشمل أن "بوضوح" تتكون من حرف جر واسم مجرور، ويجب ذكر أن شبه الجملة في محل نصب حال.
    
التصحيح: 
"بوضوح": الباء حرف جر، ووضوح اسم مجرور وعلامة جره الكسرة الظاهرة 
وشبه الجملة في محل نصب حال.

--------------------------------------------
    الجملة المراد مراجعتها:
    {sentence}

    الإعراب المقدم:
    {irab_results}

    قدم تعليقك النقدي على الإعراب أعلاه بناءً على القواعد النحوية. إذا وجدت أخطاء، قم بتحديدها وتصحيحها. إذا كان التحليل صحيحًا، قم بالتأكيد على صحته.
    [/INST]
    """,
    input_variables=["sentence", "irab_results"],
)


json_parse_prompt = PromptTemplate(
    template="""
    أنت خبير في قواعد اللغة العربية (إعراب). سأقدم لك جملة عربية أصلية وقائمة بنتائج الإعراب المفصلة لكل كلمة في الجملة. مهمتك هي:

    1. دمج نتائج الإعراب في فقرة متناسقة وفقًا لترتيب الكلمات الأصلي في الجملة.
    2. تقديم النتائج في صيغة JSON بالتنسيق التالي:
    
    **الجملة الأصلية**: {sentence}

    **النتيجة قبل JSON**:
    {irab_results}

    **النتيجة النهائية**:
    ```json
    {{
        "original_sentence": "{sentence}",
        "irab_results": [
            {{"word": "{{word1}}", "irab": "{{irab1}}"}},
            {{"word": "{{word1}}", "irab": "{{irab1}}"}},
            ...
        ],
        "special_sentences":[
            {{"sentence": "{{sentence1}}", "special_irab": "{{special_irab1}}"}},
            ...
        ],
    }}
    ```

    **مثال**:
    
    الجملة الأصلية: "الطالبُ لم يسعَ إلى النجاحِ بنفسه سريعًا."

    **النتيجة قبل JSON**:
    1. نوع الجملة: اسمية.

    2. تحليل الكلمات:


    - الطالبُ:
    أ. الوظيفة النحوية: مبتدأ.
    ب. الإعراب الكامل: مبتدأ مرفوع وعلامة رفعه الضمة الظاهرة.
    ج. معلومات إضافية: - الجذر: ط-ل-ب - الوزن: "فاعل"، صيغة اسم الفاعل من الفعل "طلب".

    - لم:
    أ. الوظيفة النحوية: حرف نفي وجزم.

    - يسعَ:
    أ. الوظيفة النحوية: فعل مضارع.
    ب. الإعراب الكامل: فعل مضارع مجزوم بحذف حرف العلة.

    - إلى:
    أ. الوظيفة النحوية: حرف جر.

    - النجاحِ:
    أ. الوظيفة النحوية: اسم مجرور متعلق بالفعل "يسعَ".
    ب. الإعراب الكامل: اسم مجرور وعلامة جره الكسرة الظاهرة.

    - بنفسه:
    أ. الوظيفة النحوية: جار ومجرور متعلق بالفعل "يسعَ".
ب. الإعراب الكامل: الباء حرف جر ونفس اسم مجرور وعلامة جره الكسرة الظاهرة. والهاء ضمير مبني فى محل جر مضاف إليه

    - سريعًا:
    أ. الوظيفة النحوية: حال يوضح كيفية السعي.
    ب. الإعراب الكامل: حال منصوب، وعلامة نصبه الفتحة الظاهرة.


    3. الجملة الفعلية "لم يسعَ إلى النجاح بنفسه سريعًا": 
    - "يسع" فعل مضارع مجزوم بحذف حرف العلة.
    - الجملة الفعلية في محل رفع خبر للمبتدأ "الطالب".

    
    **النتيجة النهائية**:
    ```json
    {{
        "original_sentence": "الطالبُ لم يسعَ إلى النجاحِ سريعًا.",
        "irab_results": [
            {{
                "word": "الطالبُ",
                "irab": "مبتدأ مرفوع وعلامة رفعه الضمة الظاهرة"
            }},
            {{
                "word": "لم",
                "irab": "حرف نفي وجزم"
            }},
            {{
                "word": "يسعَ",
                "irab": "فعل مضارع مجزوم وعلامة جزمه حذف حرف العلة"
            }},
            {{
                "word": "إلى",
                "irab": "حرف جر"
            }},
            {{
                "word": "النجاحِ",
                "irab": "اسم مجرور وعلامة جره الكسرة الظاهرة"
            }},
            {{
                "word": "بنفسه",
                "irab": "الباء حرف جر ونفس اسم مجرور وعلامة جره الكسرة الظاهرة والهاء ضمير مبني فى محل جر مضاف إليه"
            }},
            {{
                "word": "سريعًا",
                "irab": "حال منصوب وعلامة نصبه الفتحة الظاهرة"
            }}
        ],
        "special_sentences":[
            {{
                "sentence": "لم يسعَ إلى النجاحِ بنفسه سريعًا.",
                "special_irab": `الجملة الفعلية في محل رفع خبر للمبتدأ "الطالب"`
            }}
        ]
    }}
    ```

    - احرص على أن تكون الجملة الأصلية متناسقة مع نتائج الإعراب.

    الجملة الأصلية: {sentence}
    نتائج الإعراب:
    {irab_results}
    """,
    input_variables=["sentence", "irab_results"],
)

helper_prompt = PromptTemplate(
    template="""
استخرج الجمل العربية فقط
`{sentence}`

Only put the final sentences in a list format like this:     

example:
"ما زال الطالبُ مستمرًّا في الدراسةِ رغم الصعوباتِ."
out: ["ما زال الطالبُ مستمرًّا في الدراسةِ رغم الصعوباتِ."]

another example:
أحبُّ الكتابَ الذي قرأتُهُ في المكتبةِ. وأحب القراءةَ في الحديقةِ.
out: ["أحبُّ الكتابَ الذي قرأتُهُ في المكتبةِ.", "وأحب القراءةَ في الحديقةِ."]                  

stick to the format
-----------------------------
استخرج الجمل العربية فقط
`{sentence}`
"""
)
