from langchain_core.prompts import PromptTemplate

mo3gam_search_prompt = PromptTemplate(template="""
<s>
[INST]
أجب عن السؤال المعطى المتعلق بالكشف فى المعجم الوسيط مستعينا بهذه المعلومات:

**طريقة الكشف عن معنى الكلمة في المعجم**:
1. إذا كانت الكلمة المراد الكشف عنها فعلاً مضارعاً، أو أمراً، أو مشتقاً من المشتقات، أو مصدراً، نقوم بالبحث عن الماضي المجرد منها. مثال: **يسمع**، الماضي هو **سمع**.
2. إذا كانت الكلمة تحتوي على حرف أصلي مضعف، مثل **دق**، نفك التضعيف ليصبح **دقق**.
3. إذا كان أحد حروف الكلمة الأصلية هو **ألف**، مثل **قال** أو **دعا**، فالألف تكون أصلاً **واواً** أو **ياءً** حسب المضارع أو المصدر. مثال: **قال**، مضارعها **يقول** (الأصل: واو).
4. إذا كانت الكلمة مثنى أو جمعاً، نقوم بإعادتها إلى المفرد ثم تجريدها من الحروف الزائدة، مثال: **المرتفعات** تصبح **رفع**.

أيضا:
نبحث عن الكلمة حسب الحروف الأساسية بالترتيب، الحرف الأول ثم الثاني ثم الثالث. مثال: **يتمدد**، نجعلها **مدد**، ونبحث في باب **الميم**، فصل **الدال**.

**صيغة الإخراج المطلوبة**:
```json
{{
"answer": "[ضع هنا الكلمة مدعما بطريقة الكشف فى المعجم عنها]"
}}```

**قم بدورك الآن**:
1. **وضح طريقة الكشف عن الكلمة** في المعجم حسب القواعد أعلاه.
2. **أعط معنى الكلمة** إذا وُجد في النص المعطى واربط المعنى بالجملة المعطاة لك إذا أعطيت.
3. إذا لم يوجد المعنى في النص، **أعط طريقة الكشف عنها** متبوعة بمعناها استنادًا إلى معرفتك إن وُجدت.
4. إذا كانت الكلمة اسم علم. قل إنها اسم علم ثم أعط معناها وحاول ان تكشف عنها فى المعجم

**ملحوظة مهمة**:
- لا تستخدم علامة التنصيص ("") بين الكلمات. إذا تضمنت الإجابة علامات مثل `'` أو `"`, استبدلها بعلامة ❝.
- على سبيل المثال:
```json
{{
"answer": "❝أحمد اسم علم، وهو اسم النبي محمد ﷺ، ومعناه: ❝المُحمَد❝ أي: ❝المُثنى، المُشكر، المُبارك. ويكشف عن أحمد حين يرد إلى الماضى الثلاثى حمد فنكشف عنه فى باب الحاء فصل الميم والميم"
}}```

الكلمة المطلوبة: **{query}**
النص المعطى من المعجم: **{context}**
                                      
**صيغة الإخراج المطلوبة**:
```json
{{
"answer": "[ضع هنا الكلمة مدعما بطريقة الكشف فى المعجم عنها]"
}}``
[/INST]
</s>
""")