from langchain_core.prompts import PromptTemplate


SYSTEM_PROMPT = """أنت خبير في اللغة العربية والتشكيل. مهمتك إضافة التشكيل الصحيح للجمل العربية بدقة."""

tashkeel_prompt = PromptTemplate(
    template=""" [s] [INST]
{system_prompt}

أمثلة:
1. الجملة: "الذهاب إلى المدرسة في الصباح مهم."
   الجملة المشكّلة: "الذَّهَابُ إِلَى المَدْرَسَةِ فِي الصَّبَاحِ مُهِمٌّ."

2. الجملة: "الكتاب مفتوح على الطاولة."
   الجملة المشكّلة: "الكِتَابُ مَفْتُوحٌ عَلَى الطَّاوِلَةِ."

3. الجملة: "الطقس جميل اليوم."
   الجملة المشكّلة: "الطَّقْسُ جَمِيلٌ الْيَوْمَ."

4. الجملة: "الولد يلعب فى الحديقة."
   الجملة المشكّلة: "الوَلَدُ يَلْعَبُ فِى الحَدِيقَةِ."
   
أضف التشكيل للجملة التالية:
{sentence}

**ضع التشكيل على كل حرف**. إذا كنت غير متأكد، حاول اختيار التشكيل الأنسب.
أجب بالجملة المشكّلة فقط ولا تعطى أى نص آخر فى الإجابة النهائية. [/INST]
""",
    input_variables=["sentence"],
    partial_variables={"system_prompt": SYSTEM_PROMPT},
)
verification_prompt = PromptTemplate(
    template=""" [s] [INST]
{system_prompt}

هذه بعض الأمثلة على التحقق من صحة التشكيل وتصحيحه:

الجملة الأصلية: كتب الطالب الدرس
الجملة المشكّلة: كَتَبَ الطَّالِبُ الدَّرْسَ
التصحيح: كَتَبَ الطَّالِبُ الدَّرْسَ
(لا يوجد تصحيح لأن التشكيل صحيح)

الجملة الأصلية: قرأت القصة بسرعة
الجملة المشكّلة: قَرَأْتُ القصَّةَ بِسُرْعَةٍ
التصحيح: قَرَأْتُ القِصَّةَ بِسُرْعَةٍ
(تم إضافة حركة الكسرة على حرف القاف فى كلمة "القصة")

الجملة الأصلية: الشمس تشرق من الشرق
الجملة المشكّلة: الشَّمْسُ تُشْرِقُ مِنْ الشَّرْقِ
التصحيح: الشَّمْسُ تُشْرِقُ مِنَ الشَّرْقِ
(تم تصحيح "مِنْ" إلى "مِنَ" قبل الاسم المعرف بـ "ال")

الآن، تحقق من صحة التشكيل للجملة التالية وتأكد من عدم وجود كلمة بدون تشكيل:

الجملة الأصلية: {original}
الجملة المشكّلة: {diacritized}

تحقق من صحة التشكيل. إذا كان صحيحًا، أعد الجملة كما هي. إذا وجدت أخطاء، قم بتصحيحها فقط.
لا تغير الحروف. 
أجب بالجملة النهائية. 

مهم جدا: أعط الجملة النهائية عبارة عن الجملة المشكلة فقط بدون الجملة الأصلية
[/INST]
""",
    input_variables=["original", "diacritized"],
    partial_variables={"system_prompt": SYSTEM_PROMPT},
)


gemini_prompt = PromptTemplate(
    template="""{sentence} استخرج الجملة الأصلية والمشكّلة في صيغة JSON، المفاتيح المطلوبة هي: `original` و `diacritized`.""",
    input_variables=["sentence"],
)


whole_paragraph_organizer_prompt = PromptTemplate(
    template="""
                                                  
سيتم إعطاؤك أجزاء من النصوص العربية.
كل جزء عبارة عن النص المشكل وقد يكون هناك تصحيح له وقد يكون هناك بعض الكلام الإضافى
diacratized_text = النص المشكّل
الأجزاء سوف تجدها مفصولة عن بعض ب -----------.
مهمتك هى:
1. استخراج النص المشكل المصحح النهائى فقط بدون إضافات من كل جزء معطى لك
2. دمج جميع النصوص المشكلة فى نص واحد مشكل نهائى وإعطاؤه كإجابة نهائية
 
أزل خط الفصل ----------- بين الأجزاء وربطها بسلاسة.

إليك النص المقدم لك:
{text}

ارجع بإجابتك في صيغة JSON باستخدام المفتاح 'combined_diacratized_text'.
مهم جدًا: إذا احتوت القيم (القيم فقط وليس المفاتيح) في JSON على الرمز `"` فاستبدله بـ `“`.

example:
```json{{
"combine_diacratized_text": "الطّالِبُ المَدْعُوُّ “عُمَرُ“ طَالِبٌ جَيِّدٌ"
}}

""",
    input_variables=["text"],
)
